/// @description //////////////// Текст (русский)
/// @param русский
function text_ru() {
	global.txt1 = "Гранаты";
	global.txt2 = "Аптечки";
	global.txt3 = "F1";
	global.txt4 = "F2";
	global.txt5 = "ПАУЗА";
	global.txt6 = "Выход";
	global.txt7 = "Продолжить";
	global.txt8 = "Эвакуация";
	global.txt9 = "ВЫБЕРИТЕ МЕСТО";
	global.txt10 = "БАЗА";
	global.txt11 = "ПЕРЕХВАТ";
	global.txt12 = "ИССЛЕДОВАНИЯ";
	global.txt13 = "СТРОИТЬ";
	global.txt14 = "КУПИТЬ\\НАНЯТЬ";
	global.txt15 = "ПРОДАТЬ\\УВОЛИТЬ";
	global.txt16 = "ДА";
	global.txt17 = "НЕТ";
	global.txt18 = "СНЕСТИ ПОСТРОЙКУ?";
	global.txt19 = "Хорошо";
	global.txt20 = "Модулю требуется доступ к лифту для выхода на поверхность";
	global.txt21 = "Модуль используется";
	global.txt22 = "Невозможно снести модуль если это единственный путь на поверхность";
	global.txt23 = "Снести модуль невозможно";
	global.txt24 = "ВЫЙТИ";
	global.txt25 = "ИССЛЕДОВАТЬ";
	global.txt26 = "Выберите технологию";
	global.txt27 = "Жилой отсек";
	global.txt28 = "Госпиталь";
	global.txt29 = "Лаборатория";
	global.txt30 = "Лифт";
	global.txt31 = "Мастерская";
	global.txt32 = "ЗРК";
	global.txt33 = "РЛС";
	global.txt34 = "Склад";
	global.txt35 = "Штаб";
	global.txt36 = "Ангар";
	global.txt37 = "РАЗМЕСТИТЕ ЛИФТ";
	global.txt38 = "РАЗМЕСТИТЕ ЖИЛОЙ ОТСЕК";
	global.txt39 = "РАЗМЕСТИТЕ ЛАБОРАТОРИЮ";
	global.txt40 = "РАЗМЕСТИТЕ МАСТЕРСКУЮ";
	global.txt41 = "РАЗМЕСТИТЕ ШТАБ";
	global.txt42 = "РАЗМЕСТИТЕ СКЛАД";
	global.txt43 = "РАЗМЕСТИТЕ АНГАР";
	global.txt44 = "РАЗМЕСТИТЕ РЛС";
	global.txt45 = "Выберите место";
	global.txt46 = "Модернизация истребителя";
	global.txt47 = "Новый истребитель";

	global.txt48 = "Штурмовая винтовка";
	global.txt49 = "Истребитель-перехватчик T-01 ''Ветер''";
	global.txt50 = "Винтовка С.З";
	global.txt51 = "Боеприпасы для Ш.В";
	global.txt52 = "Боеприпасы для В.С.З";
	global.txt53 = "Граната";
	global.txt54 = "Снегопризывник";
	global.txt55 = "Учёный";
	global.txt56 = "Инженер";
	global.txt57 = "Авиапушка";
	global.txt58 = "Боеприпасы для авиапушки (х500)";
	global.txt59 = "Ракета ВВ-МД Р-01 ''Снегирь''";
	global.txt60 = "Ракета ВВ-СД Р-02 ''Скат''";
	global.txt61 = "Ракета ВВ-БД Р-33ХТ ''Стрела''";
	global.txt62 = "Авиабомба";
	global.txt63 = "Лазерная винтовка";
	global.txt64 = "Энергетический излучатель";
	global.txt65 = "Обломки мотожука";
	global.txt66 = "Обломки метал-соника";
	global.txt67 = "Обломки пешки";
	global.txt68 = "Обломки кибердиска";
	global.txt69 = "Обломки излучателя";
	global.txt70 = "Обломки турели";
	global.txt71 = "ПКР ВВ-БД Р-03 ''Лавина''";
	global.txt72 = "Суперсплавы";
	global.txt73 = "Транспортный вертолёт ST-01 ''Скаут''";
	global.txt74 = "Истребитель-перехватчик T-02 ''Пингвин''";
	global.txt75 = "Многоцелевой истребитель Х-Торнадо";
	global.txt76 = "Истребитель-перехватчик Т-03 ''Альбатрос''";
	global.txt77 = "Истребитель-перехватчик Т-04X ''Фотон''";
	global.txt78 = "Истребитель-перехватчик МиГ-31Х";
	global.txt79 = "Транспортный СВВП ST-02X ''Рейнджер''";
	global.txt80 = "Транспортный конвертоплан ST-03 ''Вихрь''";
	global.txt81 = "ПРИМЕНИТЬ";
	global.txt82 = "ВЫ УВЕРЕНЫ?";
	global.txt83 = "НЕДОСТАТОЧНО СРЕДСТВ!";
	global.txt84 = "Денег: $";
	global.txt85 = "Стоимость: $";
	global.txt86 = "Заказ прибудет через 12 часов";
	global.txt87 = "НЕДОСТАТОЧНО МЕСТА!";
	global.txt88 = " прибыл";
	global.txt90 = "Свободное место на складах: ";
	global.txt91 = "Свободное место в ангарах: ";
	global.txt92 = "Свободное место в казармах: ";
	global.txt93 = "Расходы на обслуживание:";
	global.txt94 = "Ежемесячное обслуживание:";
	global.txt95 = "Солдат на лечении:";
	global.txt96 = "Терактов предотвращено:";
	global.txt97 = "СТАТИСТИКА";
	global.txt98 = "СТРОИТСЯ";
	global.txt99 = "НЕДОСТАТОЧНО РЕСУРСОВ";
	global.txt100 = "НЕДОСТАТОЧНО ДЕНЕГ";
	global.txt101 = "НЕ ХВАТАЕТ МЕСТА";
	global.txt102 = "ПРОИЗВОДСТВО";
	global.txt103 = "ч."; // часов
	global.txt104 = "ДОБАВИТЬ ПРОИЗВОДСТВО";
	global.txt105 = "Выберите тех. задание";
	global.txt106 = "Медпакет";
	global.txt107 = "Места доступно: ";
	global.txt108 = "Нужно места на складе: ";
	global.txt109 = "Нужно денег: ";
	global.txt110 = "Нужно суперсплавов: ";
	global.txt111 = "Нужно излучателей: ";
	global.txt112 = "Нужно обломков излучателей: ";
	global.txt113 = "Места в лаборатории: ";
	global.txt114 = "Нужно места: ";
	global.txt115 = "Подвесной топливный бак";
	global.txt116 = "АВИАПУШКА";
	global.txt117 = "СНЕГИРЬ";
	global.txt118 = "СКАТ";
	global.txt119 = "СТРЕЛА";
	global.txt120 = "ЛАВИНА";
	global.txt121 = "ПТБ";
	global.txt122 = "АВИАБОМБА";
	global.txt123 = "ПУСТО";
	global.txt124 = "Топливо: %";
	global.txt125 = "Прочность: %";
	global.txt126 = "ЗПРВК";
	global.txt127 = "РЕМОНТ";
	global.txt128 = "ПРЗРДК";
	global.txt129 = "ГОТОВ";
	global.txt130 = "СПИСАТЬ";
	global.txt131 = "На складе не хватает боекомплекта!";
	global.txt132 = "Самолётам не хватает боеприпасов!";
	global.txt133 = "УСТАНОВКА ОРУЖИЯ";
	global.txt134 = "ПОДРОБНО";
	global.txt135 = "Оружие 1";
	global.txt136 = "Оружие 2";
	global.txt137 = "Оружие 3";
	global.txt138 = "Списать самолёт?";
	global.txt139 = "АВИАЦИЯ";
	global.txt140 = "Выберите оружие";
	global.txt141 = "Соник ёж"; // неслух
	global.txt142 = "Майлз 'Тейлз' Прауэр"; // адмирал пушистый хвостик
	global.txt143 = "Эми Роуз"; // терминатор
	global.txt144 = "Руж летучая мышь"; // летучий мышеплюх
	global.txt145 = "Сильвер ёж"; // капитан манишка
	global.txt146 = "Шэдоу ёж"; // тень ежа
	global.txt147 = "Наклз ехидна"; // красный на руку опасный
		global.txt1419 = "Неслух Ёжик"; // неслух
		global.txt1429 = "Адмирал Пушистый Хвостик"; // адмирал пушистый хвостик
		global.txt1439 = "Терминатор Роза"; // терминатор
		global.txt1449 = "Летучий мышеплюх"; // летучий мышеплюх
		global.txt1459 = "Капитан Манишка"; // капитан манишка
		global.txt1469 = "Тень Ежа"; // тень ежа
		global.txt1479 = "Красный ехиднолёт"; // красный на руку опасный
	global.txt148 = "НА ЛЕЧЕНИИ";
	global.txt149 = "НА БОРТУ";
	global.txt150 = "МЕМОРИАЛ";
	global.txt151 = "Доступно места в казармах: ";
	global.txt152 = "Мест осталось: ";
	global.txt153 = "Гранат на борту: ";
	global.txt154 = "Аптечек на борту: ";
	global.txt155 = "НЕТ БОЕПРИПАСОВ!";
	global.txt156 = "УВОЛИТЬ";
	global.txt157 = "Здоровье: ";
	global.txt158 = "ВИНТОВКА";
	global.txt159 = "АВТОМАТ";
	global.txt160 = "ЛАЗЕР";
	global.txt161 = "ПУСТО";
	global.txt162 = "ПЕХОТА";
	global.txt163 = "Уволить солдата?";
	global.txt164 = "НА БАЗЕ";
	global.txt165 = "Выберите назначение";
	global.txt166 = "Разместите подземную базу проекта X-MAS";
	global.txt167 = "Станция РЛС";
	global.txt168 = "Станция ПВО";
	global.txt169 = "Завод игрушек";
	global.txt170 = "Полярный город";
	global.txt171 = "Волшебное поселение";
	global.txt172 = "Подземный склад игрушек";
	global.txt173 = "Подземная база роботов";
	global.txt174 = "База X-MAS";
	global.txt175 = "ВВЕДИТЕ НАЗВАНИЕ";
	global.txt176 = "ВЫБЕРИТЕ САМОЛЕТЫ";
	global.txt177 = "ВЫБЕРИТЕ НАЗНАЧЕНИЕ";
	global.txt178 = "ЦЕЛЬ - ";
	global.txt179 = "РАЗБИТОЕ НЛО ";
	global.txt180 = "МЕСТО ТЕРРОРА ";
	global.txt181 = "НЛО ";
	global.txt182 = "ТОЧКА";
	global.txt183 = "БАЗА ";
	global.txt184 = "НЕТ ТОПЛИВА";
	global.txt185 = "Эскадрилья ";
	global.txt186 = " ЭСКАДРИЛЬЯ: ТОПЛИВО НА ИСХОДЕ";
	global.txt187 = "Роботизированный истребитель";
	global.txt188 = "Неизвестный сплав";
	global.txt189 = "Десантный СВВП";
	global.txt190 = "Десантный конвертоплан";
	global.txt191 = "Энергетический излучатель";
	global.txt192 = "Ручной излучатель";
	global.txt193 = "Энерго-Бомба";
	global.txt194 = "Тяжёлый перехватчик";
	global.txt195 = "Турель";
	global.txt196 = "Полевая арктическая медицина";
	global.txt197 = "САНТАПЕДИЯ";
	global.txt198 = "БК "; // боекомплект
	global.txt199 = "СКР: ";
	global.txt200 = "ЗДР: ";
	global.txt201 = "Е-104";
	global.txt202 = "Е-140";
	global.txt203 = "Е-201";
	global.txt204 = "Е-100";
	global.txt205 = "Е-500";
	global.txt206 = "Флагман";
	global.txt207 = "Наш самолёт был сбит!";
	global.txt208 = "Вражеский самолёт был сбит!";
	global.txt209 = "Вражеский самолёт обнаружен.";
	global.txt210 = "Вражеский самолёт сбежал!";
	global.txt211 = "Наш самолёт сбежал!";
	global.txt212 = "Союзный самолёт был сбит!";
	global.txt213 = "Союзный самолёт сбежал!";
	global.txt214 = "Воздушный бой выигран. Принять итоги?";
	global.txt215 = "Воздушный бой проигран. Принять итоги?";
	global.txt216 = "НА БАЗУ";
	global.txt217 = "ПАТРУЛИРУЕТ";
	global.txt218 = "ПРЕСЛЕДУЕТ";
	global.txt219 = "Новая цель";
	global.txt220 = "На базу";
	global.txt221 = ": левый двигатель выведен из строя";
	global.txt222 = ": правый двигатель выведен из строя";
	global.txt223 = ": двигатель выведен из строя";
	global.txt224 = ": пилот контужен";
	global.txt225 = ": левое крыло повреждено";
	global.txt226 = ": правое крыло повреждено";
	global.txt227 = ": не может лететь, пилот катапультировался";
	global.txt228 = "НСПРВ!";
	global.txt229 = "КАЗАРМА";
	global.txt230 = "ОБНАРУЖЕН ";
	global.txt231 = "ЦЕЛЬ ДОСТИГНУТА: ЭСКАДРИЛЬЯ ";
	global.txt232 = "Ручной бой";
	global.txt233 = "Преследовать";
	global.txt234 = "ПРЕСЛЕДОВАНИЕ ЗАВЕРШЕНО: ЭСКАДРИЛЬЯ ";
	global.txt235 = "ВРАГ СЛИШКОМ ВЫСОКО: ЭСКАДРИЛЬЯ ";
	global.txt236 = "Высота (м): ";
	global.txt237 = "ЭСКАДРИЛЬЯ ";
	global.txt238 = "Скорость (км/ч): ";
	global.txt239 = "ЦЕЛЬ ИСЧЕЗЛА С КАРТЫ МИРА";
	global.txt240 = "Численность НЛО: ";
	global.txt241 = "Задача: неизвестна";
	global.txt242 = "Задача: разведка";
	global.txt243 = "Задача: господство";
	global.txt244 = "Задача: атака армии";
	global.txt245 = "Задача: бомбардировка";
	global.txt246 = "Задача: бомбардировка баз";
	global.txt247 = "Задача: террор";
	global.txt248 = "Задача: строительство";
	global.txt249 = "Задача: командование";
	global.txt250 = "Автобой";
	global.txt251 = "Воздушный бой выигран";
	global.txt252 = "Воздушный бой проигран";
	global.txt253 = "Воздушный бой закончился взаимным уничтожением";
	global.txt254 = "Воздушный бой закончился ничьей";
	global.txt255 = "ВЫБОР ЭСКАДРИЛЬИ";
	global.txt256 = "ВЫБОР";
	global.txt257 = "ОТМЕНА";
	global.txt258 = "СОЮЗНИКА ";
	global.txt259 = "ВРАГ ПЕРЕХВАТИЛ НАС: ЭСКАДРИЛЬЯ ";
	global.txt260 = "ВОЗДУШНЫЙ ТРАНСПОРТ ПОД УГРОЗОЙ ";
	global.txt261 = "ОБЪЕКТ АТАКОВАН С ВОЗДУХА ";
	global.txt262 = "Максимальный размер цели: ";
	global.txt263 = "Огромный";
	global.txt264 = "Большой";
	global.txt265 = "Средний";
	global.txt266 = "Малый";
	global.txt267 = "Оч. малый";
	global.txt268 = "Пролёт неопознанного самолета ";
	global.txt269 = "Взрывы в небе ";
	global.txt270 = "Наземный конвой обстрелян ";
	global.txt271 = "Патруль уничтожен ";
	global.txt272 = "Шум в небе ";
	global.txt273 = "Помехи в радиосвязи ";
	global.txt274 = "Шум на радаре ";
	global.txt275 = "Активность неопознанных роботов ";
	global.txt276 = "Неопознанные строительные работы ";
	global.txt277 = "Опорный пункт уничтожен ";
	global.txt278 = "База Эггмана ";
	global.txt279 = "Крепость Эггмана ";
	global.txt280 = "Обнаружена новая база Эггмана";
	global.txt281 = "Союзник ";
	global.txt282 = "СНАРЯЖЕНИЕ";
	global.txt283 = "СОЛДАТЫ";
	global.txt284 = "ПОСТРОЙКИ";
	global.txt285 = "АВИАОРУЖИЕ";
	global.txt286 = "АВИАЦИЯ";
	global.txt287 = "РОБОТЕХ";
	global.txt288 = "РОБОТЫ";
	global.txt289 = "РОБОСАМОЛЕТЫ";
	global.txt290 = "САНТАПЕДИЯ - КАТЕГОРИИ";
	global.txt291 = "Высадка!";
	global.txt292 = "Атаковать с воздуха";
	global.txt293 = "Атаковать с воздуха невозможно: нет подходящего оружия!";
	global.txt294 = "Атака с воздуха завершена, удалось уничтожить роботов: ";
	global.txt295 = "В эскадрилье нет десантных кораблей с боеспособным отрядом пехоты!";
	global.txt296 = " ТЕРРОРИЗИРУЕТ ";
	global.txt297 = " ШТУРМУЕТ ";
	global.txt298 = " БОМБИТ ";
	global.txt299 = "ВОЗДУШНЫЙ БОЙ ";
	global.txt300 = "МЕСТО КРУШЕНИЯ НЛО ";
	global.txt301 = "Наземный бой окончен. Принять итоги боя?";
	global.txt302 = "Задача: уничтожить всех противников";
	global.txt303 = "Задача: выживать в течении указанного времени";
	global.txt304 = "Задача: найти изумруд и эвакуироваться";
	global.txt305 = "Наземный бой выигран. Принять итоги?";
	global.txt306 = "Наземный бой проигран. Принять итоги?";
	global.txt307 = "Наземный бой окончился ничьей. Принять итоги?";
	global.txt308 = "ЕЖЕНЕДЕЛЬНЫЙ ОТЧЁТ ПРОЕКТА X-MAS";
	global.txt309 = "Очки противника: ";
	global.txt310 = "Очки проекта X-MAS: ";
	global.txt311 = "Количество финансов к следующей неделе: ";
	global.txt312 = "Количество полученных финансов: ";
	global.txt313 = "Расходы на обслуживание: ";
	global.txt314 = "Потеряно городов: ";
	global.txt315 = ". Если вы потеряете больше 2 городов вы проиграете!";
	global.txt316 = "На этой неделе проект X-MAS удовлетворяет требованиям процесса подготовки к новому году. Продолжайте в том же духе.";
	global.txt317 = "На этой неделе проект X-MAS не справился с возложенными на него задачами. Поднажмите, иначе Эггман сорвёт новый год!";
	global.txt318 = "На этой неделе проект X-MAS произвёл хорошее впечатление на Деда Мороза! Продолжайте в том же духе!";
	global.txt319 = "ЧИТАТЬ";
	global.txt320 = "От: ";
	global.txt321 = "Кому: ";
	global.txt322 = "Тема: ";
	global.txt323 = "ПОЧТА";
	global.txt324 = "НАЧАТЬ ИГРУ";
	global.txt325 = "НОВАЯ ИГРА";
	global.txt326 = "ПРОДОЛЖИТЬ ИГРУ";
	global.txt327 = "НАСТРОЙКИ";
	global.txt328 = "ВЫХОД";
	global.txt329 = "НАЗАД";
	global.txt330 = "ТЕСТОВЫЙ БОЙ (В)";
	global.txt331 = "ТЕСТОВЫЙ БОЙ (З)";
	global.txt332 = "Проект X-MAS: Защита нового года";
	global.txt333 = "Версия: ";
	global.txt334 = "ЛЁГКАЯ СЛОЖНОСТЬ";
	global.txt335 = "СРЕДНЯЯ СЛОЖНОСТЬ";
	global.txt336 = "ВЫСОКАЯ СЛОЖНОСТЬ";
	global.txt337 = "ЗВУК";
	global.txt338 = "МУЗЫКА";
	global.txt339 = "СМЕРТИ";
	global.txt340 = "ВИДЕО";
	global.txt341 = "Выйти в меню и сохранить игру?";
	global.txt342 = "Исследование завершено: ";
	global.txt343 = ".#Открыть сантапедию?";
	global.txt344 = "Производство завершено: ";
	global.txt345 = "НАЗЕМНЫЙ БОЙ: ЗАЧИСТКА ТЕРРИТОРИИ";
	global.txt346 = "Вражеский корабль успел произвести высадку роботизированных сил в этом районе. Необходимо провести зачистку территории для вывоза трофейной техники и обеспечения безопасности#Уничтожьте все вражеские силы, в случае, если противник окажется слишком силён - запросите эвакуацию";
	global.txt347 = "НАЗЕМНЫЙ БОЙ: ОБОРОНА ГОРОДА";
	global.txt348 = "Вражеский транспорт активно десантирует боевых роботов с целью уничтожить одно из ключевых поселений Деда Мороза. Силы обороны города активно ведут бои, но не смогут выстоять в одиночку. Помогите продержаться армии Деда Мороза до прихода подкреплений#Сдерживайте врага до истечения указанного времени, в случае, если противник окажется слишком силён - запросите эвакуацию, но учтите, что в этом случае поселение будет уничтожено";
	global.txt349 = "НАЗЕМНЫЙ БОЙ: ЭКСТРАКЦИЯ ИЗУМРУДА";
	global.txt350 = "В этом районе было обнаружено излучение характерное для присутствия хаос-изумруда. Найдите изумруд, доставьте его на корабль и эвакуируйтесь, но не медлите, так как противник уже знает о вашем присутствии здесь#Найдите изумруд и доставьте его на корабль, в случае, если противник окажется слишком силён - запросите эвакуацию";
	global.txt351 = "НАЗЕМНЫЙ БОЙ: ШТУРМ АВАНПОСТА";
	global.txt352 = "В этом районе был обнаружен вражеский аванпост, угрожающий союзным силам и подрывающий деятельность проекта X-MAS. Проникните на базу и зачистите её от сил противника, но будьте осторожны, база серьёзно защищена и не перестаёт производить роботов, которые так и будут нападать на вас, пока вы не уничтожите все подъемники из производственного модуля#Уничтожьте все вражеские силы и лифты, в случае, если противник окажется слишком силён - запросите эвакуацию";
	global.txt353 = "НАЗЕМНЫЙ БОЙ: ОБОРОНА БАЗЫ";
	global.txt354 = "База проекта X-MAS была скомпрометирована и подверглась наземному нападению высаженным десантом, чей транспорт силам ПВО не удалось вовремя сбить. Сдерживайте натиск до прибытия подкрепления и не вздумайте отступать: поражение будет означать конец проекта X-MAS#Сдерживайте вражеские силы до истечения указанного времени";
	global.txt355 = "Всего убито: ";
	global.txt356 = "Всего потеряно: ";
	global.txt357 = "Всего заработано опыта: ";
	global.txt358 = "Всего получено очков: ";
	global.txt359 = "Всего трофеев: ";
	global.txt360 = "ПОРАЖЕНИЕ ";
	global.txt361 = "ПОБЕДА ";
	global.txt362 = "Активность вражеских сил не предотвращена, миссия провалена";
	global.txt363 = "Активность противника прекращена, миссия выполнена";
	global.txt364 = "Изумруд эвакуирован, миссия выполнена";
	global.txt365 = "Изумруд не был эвакуирован, миссия провалена";
	global.txt366 = "Аванпост противника уничтожена, миссия выполнена";
	global.txt367 = "Аванпост противника продолжает функционировать, миссия провалена";
	global.txt368 = "Наша база была уничтожена, проект закрыт";
	global.txt369 = "Наша база продолжает функционировать, миссия выполнена";
	global.txt370 = "БАЗА ПРОЕКТА X-MAS ПОДВЕРГЛАСЬ АТАКЕ!";
	global.txt371 = "Комплекс ЗРК ";
	global.txt372 = " открывает огонь...";
	global.txt373 = "Бомбардировщик не был сбит! Осталось целей: ";
	global.txt374 = "Бомбардировщик СБИТ! Осталось целей: ";
	global.txt375 = "Все комплексы ПВО отработали по целям, противник начал бомбардировку...";
	global.txt376 = "Нанёс урон: ";
	global.txt377 = "Бомбардировщики сбиты, ПВО справилось с задачей!";
	global.txt378 = "Бомбардировщик ";
	global.txt379 = " бомбит нашу базу...";
	global.txt380 = "Модуль ";
	global.txt381 = "повреждён!";
	global.txt382 = "Удар так же пришёлся по соседним модулям!";
	global.txt383 = "Некоторые самолёты получили повреждения!";
	global.txt384 = "Модуль пережил бомбардировку.";
	global.txt385 = "Некоторые самолёты были уничтожены!";
	global.txt386 = "Бомбардировка прекратилась...";
	global.txt387 = "Опыт: ";
	global.txt388 = "В сантапедии обновилась информация по авиации противника...";
	global.txt389 = "Транспортники сбиты, ПВО справилось с задачей!";
	global.txt390 = "Транспорт не был сбит! Осталось целей: ";
	global.txt391 = "Транспорт СБИТ! Осталось целей: ";
	global.txt392 = "БАЗА ПРОЕКТА X-MAS ПОД УГРОЗОЙ ВТОРЖЕНИЯ!";
	global.txt393 = "Есть уцелевший транспорт противника, готовимся к вторжению...";
	global.txt394 = "Обнаружено место выпадения изумруда!";
	global.txt395 = "Место выпадения изумруда ";
	global.txt396 = "Обнаружена большая вражеская активность в радиоэфире";
	global.txt397 = "Аванпост роботов ";
	global.txt398 = "Город был уничтожен ";
	global.txt399 = "Всего учёных: ";
	global.txt400 = "Всего инженеров: ";
	global.txt401 = "Неизвестно";
	global.txt402 = "Едва известно";
	global.txt403 = "Малоизвестно";
	global.txt404 = "Хорошо известно";
	global.txt405 = "Почти изучено";
	global.txt406 = "Строительство на поверхности ещё не изучено!";
	global.txt407 = "Ракета ВВ-БД Р-03 ''Зилот''";
	global.txt408 = "Улучшенная авиапушка";
	global.txt409 = "СПРАВОЧНИК";
	global.txt410 = "Акция противника завершилась успешно, мы не успели среагировать";
	global.txt411 = "ЭСКДР ";
	global.txt412 = "Проект X-MAS потерпел поражение, новый год сорван...";
	global.txt413 = "После поражения проекта X-MAS регулярная армия Деда Мороза продолжила сопротивление вместе с уцелевшими остатками проекта, но оно было обречено на поражение под напором гения Эггмана";
	global.txt414 = "Проект X-MAS завершен успешно, новый год спасён!";
	global.txt415 = "После успешного отражения агрессии доктора Эггмана приготовления к новому году были завершены успешно и новый год прошел как по маслу!";
	global.txt416 = "Ожидаемый доход: ";
	global.txt417 = "Активность противника: ";
	global.txt418 = "Наша активность: ";
	global.txt419 = "Нужно обломков турелей: ";
	global.txt420 = "Нужно обломков мотожуков: ";
	global.txt421 = "Нужно обломков метал соника: ";
	global.txt422 = "Нужно обломков эгг-пешек: ";
	global.txt423 = "Нужно обломков левитирующих танков: ";
	global.txt424 = "Вы уверены? Старое сохранение не будет стёрто";
	global.txt425 = "Леденцовый город";
	global.txt426 = "Ледяной дворец";
	global.txt427 = "Пехоте не хватает боеприпасов!";
	global.txt428 = "Удары с воздуха по хаос-изумруду небезопасны!";
	global.txt429 = "Время до завершения события (часов): ";
	global.txt430 = "ТРАНСПОРТ УСПЕЕТ";
	global.txt431 = "Дед мороз поддержит атаку на эту базу";
	global.txt432 = "Дед мороз не поддержит атаку на эту базу";
	global.txt433 = "АВТОСОХРАНЕНИЕ";
	global.txt434 = "ТЭНГЛ И ДРУЗЬЯ";
	global.txt435 = "Соберите 25000 очков для победы в игре и не дайте себя затискать человекам!#Нажмите [ESC] чтобы выйти#Водите курсором, чтобы передвигаться#Нажмите [Q] чтобы произносить звуки (+500 очков, но люди временно ускоряются)";
	global.txt436 = "Собрано очков: ";
	global.txt437 = "Осталось попыток: ";
	global.txt438 = "ВЫ ЗАТИСКАНЫ";
	global.txt439 = "ВЫ ПОБЕДИЛИ";
	global.txt440 = "Задача: снабжение";
	global.txt441 = "УЛУЧШЕННАЯ АВИАПУШКА";
	global.txt442 = "ЗИЛОТ";
	global.txt443 = "Грузоподъемность: ";
	global.txt444 = "Загрузить автосохранение, а не обычное сохранение?";
	global.txt445 = "БЕЗ СОХРАНЕНИЯ";
	global.txt446 = "ЕСТ ЯБЛОКИ";
	global.txt447 = "Многоблочная ракета воздух-воздух";
	global.txt448 = " МЕЖДУ ";
	global.txt449 = " С ";
	global.txt450 = "Перезапустить бой?";
	global.txt451 = "";
	global.txt452 = "";
	global.txt453 = "";
	global.txt454 = "";
	global.txt455 = "";
	global.txt456 = "";
	global.txt457 = "";
	global.txt458 = "";
	global.txt459 = "";
	global.txt460 = "";
	global.txt461 = "";
	global.txt462 = "";
	global.txt463 = "";
	global.txt464 = "";
	global.txt465 = "";
	global.txt466 = "";
	global.txt467 = "";
	global.txt468 = "";
	global.txt469 = "";
	global.txt470 = "";
	global.txt471 = "";
	global.txt472 = "";
	global.txt473 = "";
	global.txt474 = "";
	global.txt475 = "";
	global.txt476 = "";
	global.txt477 = "";
	global.txt478 = "";
	global.txt479 = "";
	global.txt480 = "";
	global.txt481 = "";
	global.txt482 = "";
	global.txt483 = "";
	global.txt484 = "";
	global.txt485 = "";
	global.txt486 = "";
	global.txt487 = "";
	global.txt488 = "";
	global.txt489 = "";
	global.txt490 = "";
	global.txt491 = "";
	global.txt492 = "";
	global.txt493 = "";
	global.txt494 = "";
	global.txt495 = "";
	global.txt496 = "";
	global.txt497 = "";
	global.txt498 = "";
	global.txt499 = "";
	global.txt500 = "";
	global.txt501 = "";
	global.txt502 = "";
	global.txt503 = "";
	global.txt504 = "";
	global.txt505 = "";
	global.txt506 = "";
	global.txt507 = "";
	global.txt508 = "";
	global.txt509 = "";
	global.txt510 = "";
	global.txt511 = "";
	global.txt512 = "";
	global.txt513 = "";
	global.txt514 = "";
	global.txt515 = "";
	global.txt516 = "";
	global.txt517 = "";
	global.txt518 = "";
	global.txt519 = "";
	global.txt520 = "";
	global.txt521 = "";
	global.txt522 = "";
	global.txt523 = "";
	global.txt524 = "";
	global.txt525 = "";
	global.txt526 = "";
	global.txt527 = "";
	global.txt528 = "";
	global.txt529 = "";
	global.txt530 = "";
	global.txt531 = "";
	global.txt532 = "";
	global.txt533 = "";
	global.txt534 = "";
	global.txt535 = "";
	global.txt536 = "";
	global.txt537 = "";
	global.txt538 = "";
	global.txt539 = "";
	global.txt540 = "";
	global.txt541 = "";
	global.txt542 = "";
	global.txt543 = "";
	global.txt544 = "";
	global.txt545 = "";
	global.txt546 = "";
	global.txt547 = "";
	global.txt548 = "";
	global.txt549 = "";
	global.txt550 = "";
	global.txt551 = "";
	global.txt552 = "";
	global.txt553 = "";
	global.txt554 = "";
	global.txt555 = "";
	global.txt556 = "";
	global.txt557 = "";
	global.txt558 = "";
	global.txt559 = "";
	global.txt560 = "";
	global.txt561 = "";
	global.txt562 = "";
	global.txt563 = "";
	global.txt564 = "";
	global.txt565 = "";
	global.txt566 = "";
	global.txt567 = "";
	global.txt568 = "";
	global.txt569 = "";
	global.txt570 = "";
	global.txt571 = "";
	global.txt572 = "";
	global.txt573 = "";
	global.txt574 = "";
	global.txt575 = "";
	global.txt576 = "";
	global.txt577 = "";
	global.txt578 = "";
	global.txt579 = "";
	global.txt580 = "";
	global.txt581 = "";
	global.txt582 = "";
	global.txt583 = "";
	global.txt584 = "";
	global.txt585 = "";
	global.txt586 = "";
	global.txt587 = "";
	global.txt588 = "";
	global.txt589 = "";
	global.txt590 = "";
	global.txt591 = "";
	global.txt592 = "";
	global.txt593 = "";
	global.txt594 = "";
	global.txt595 = "";
	global.txt596 = "";
	global.txt597 = "";
	global.txt598 = "";
	global.txt599 = "";
	global.txt600 = "";
	global.txt601 = "";
	global.txt602 = "";
	global.txt603 = "";
	global.txt604 = "";
	global.txt605 = "";
	global.txt606 = "";
	global.txt607 = "";
	global.txt608 = "";
	global.txt609 = "";
	global.txt610 = "";
	global.txt611 = "";
	global.txt612 = "";
	global.txt613 = "";
	global.txt614 = "";
	global.txt615 = "";
	global.txt616 = "";
	global.txt617 = "";
	global.txt618 = "";
	global.txt619 = "";
	global.txt620 = "";
	global.txt621 = "";
	global.txt622 = "";
	global.txt623 = "";
	global.txt624 = "";
	global.txt625 = "";
	global.txt626 = "";
	global.txt627 = "";
	global.txt628 = "";
	global.txt629 = "";
	global.txt630 = "";
	global.txt631 = "";
	global.txt632 = "";
	global.txt633 = "";
	global.txt634 = "";
	global.txt635 = "";
	global.txt636 = "";
	global.txt637 = "";
	global.txt638 = "";
	global.txt639 = "";
	global.txt640 = "";
	global.txt641 = "";





	global.wikit1 = "Автоматическая штурмовая винтовка";
	global.wikit2 = "Повторяющая облик известного автомата Калашникова, стандартная штурмовая винтовка армии Деда Мороза, обладает умеренной точностью и эффективностью, которая преимущественно используется для стрельбы очередями. Автомат предназначен для поражения живой силы противника, что снижает его эффективость против защищённых целей. Разработанный в далёкие годы и постепенно теряющий актуальность, автомат прошёл через множество пограничных конфликтов и хорошо себя зарекомендовал. #Урон - 25 х 3";
	global.wikit3 = "Крупнокалиберная винтовка со скользящим затвором";
	global.wikit4 = "Недавно разработанная специально для борьбы с защищёнными целями, винтовка показывает умеренную эффективность против механизированных противников. Бронебойные пули с вольфрамовым стержнем, используемые винтовкой, пробивают до 35 мм стали, имея при этом довольно скромное заброневое действие. К сожалению, вес и габариты конструкции не позволили сделать винтовку автоматической. Будучи эффективной против хорошо защищённых целей, винтовка показывает блоее скромную эффективность против слабых целей в сравнении с автоматом. #Урон - 30 #Бронебойность - 10";
	global.wikit5 = "Лучевая винтовка";
	global.wikit6 = "Наше новейшее компактное лучевое оружие разработанное в рамках проекта X-MAS и использующее трофейные технологии империи Эггмана. Инфракрасный луч винтовки игнорирует броню цели и наносит ей существенный урон. Ёмкость батарей винтовки позволяет без перезарядки использовать её на поле боя, а использование трофейных сплавов позволяет эффективно бороться с перегревом установки. Испытывая компромисс между трофейными технологиями и технологическим уровнем армии Деда Мороза, винтовка страдает от высокой стоимости и более скромными характеристиками в сравнении с видами оружия противника. #Урон - 40";
	global.wikit7 = "Авиапушка";
	global.wikit8 = "Специально разработанная для борьбы с бронированными целями, авиапушка использует снаряды с вольфрамовым стержнем и урановой оболочкой, пробивающие четверть метра стали. Система Гатлинга позволяет достичь скорострельности в 11000 выстрелов в минуту и поразить любую известную и подходящую для перехвата цель.#Помимо атаки воздушных целей может применяться для атаки наземных целей, что делает её универсальным оружием.#Дальность - 30";
	global.wikit9 = "Медпакет";
	global.wikit10 = "Суровые условия Арктики делают невозможным в полевых условиях хирургическое вмешательство и затрудняют применение стандартных полевых аптечек и медикаментов. Выходом из ситуации стало использование специальных медикаментов, коагулянтов и стимуляторов с системой автоматического введения в кровь, своевременное введение которых позволяет отсрочить хирургическое вмешательство, если оно необходимо, и улучшить состояние раненого.";
	global.wikit11 = "Граната";
	global.wikit12 = "Граната особой мощности, стоящая на вооружении армии Деда Мороза, может эффективно использоваться для борьбы с любыми целями. Мощная взрывчатка и особый материал оболочки позволяют игнорировать броню противника в разумных пределах.#Эффективна для уничтожения построек противника.";
	global.wikit13 = "РВВ-МД ''Снегирь''";
	global.wikit14 = "Ракета Воздух-Воздух Малой Дальности ''Снегирь'' - передовая ракета ближнего боя, пользующаяся популярностью благодаря малым габаритам и весу. Имеет стержневую боеголовку и тепловую систему наведения, что делает её эффективной против большинства целей и позволяет производить пуск с дистанции большей, чем дальность стрельбы авиапушек. Однако, используемая ИК ГСН не может перенацеливать её в воздухе, а стержневая БЧ хоть и позволяет при удачном попадании мгновенно разрезать цель, но неэффективна против защищенных целей и не может работать по групповым целям. #Дальность - 60";
	global.wikit15 = "РВВ-СД ''Скат''";
	global.wikit16 = "Передовая ракета Воздух-Воздух Средней Дальности со специально экранированными системами, совмещает полуактивную и активную системы радиолокационного наведения с мощной фугасной боеголовкой. Прекрасный выбор против большинства целей. Благодаря АРГСН ракета перенацеливается в воздухе на ближайшую цель в случае, если предыдущая была уничтожена. Кроме того, фугасная БЧ позволяет работать по групповым целям. #Дальность - 110";
	global.wikit17 = "РВВ-БД ''Стрела''";
	global.wikit18 = "Глубоко модернизированная ракета Воздух-Воздух Большой Дальности Р-33, использующая активную и пассивную системы радиолокационного наведения. Имея мощную шрапнельную боеголовку, ракета разгоняется до почти гиперзвуковой скорости на заключительном участке траектории, что делает выпускаемые ракетой вольфрамовые снаряды воистину смертоносными. К сожалению, большой вес ракеты не позволяет подвесить более трёх ракет на точку подвески. #Дальность - 200";
	global.wikit19 = "ПКР ''Лавина''";
	global.wikit20 = "Сверхтяжёлая ракета противокорабельного класса, разработанная специально для борьбы с материнским кораблём воздушного флота Эггмана. В качестве боевой части используется термоядерная боеголовка мощностью 0,1 Кт с неядерным энергетическим лучевым детонатором, что позволяет достичь рекордного КПД установки и добиться приемлимой чистоты реакции в сравнении с классической ядерной имплозией. Вес ракеты не позволяет подвесить более одной ракеты на точку подвески. #Дальность - 230";
	global.wikit21 = "Авиабомба";
	global.wikit22 = "Стандартное штурмовое снаряжение авиации Деда Мороза. Используется для поддержки с воздуха наземных сил. Может быть использовано любым самолётом для уничтожения или ослабления цели с воздуха. Дешево и сердито";
	global.wikit23 = "Подвесной топливный бак";
	global.wikit24 = "Стандартный подвесной топливный бак (П.Т.Б) армии Деда Мороза. Используется с целью увеличить дальность полёта самолёта и является одноразовым. Применяйте, если вам не хватает дальности полёта истребителей, но имейте ввиду, что он будет установлен вместо оружия.";
	global.wikit25 = "Лифт";
	global.wikit26 = "Подземный модуль, имеющий выход на поверхность и состоящий из бронированного грузового лифта, грузоподъёмность и габариты которого позволяют наладить сообщения с поверхностью как персонала, так и крупных объектов (например, самолётов) в разобранном виде. #Уязвимость к бомбардировкам: да";
	global.wikit27 = "Казарма";
	global.wikit28 = "Многоэтажный подземный модуль, рассчитаный на постоянное пребывание персонала базы и обеспечивающий комфортное существование персоналу. Имеет комнату отдыха, санузлы (включая душевые), шкафчики для хранения личных вещей и спальные койко-места. Обеспечивает существование до 30 человек. #Уязвимость к бомбардировкам: нет";
	global.wikit29 = "Лаборатория";
	global.wikit30 = "Исследовательский подземный модуль, оснащённый передовым научным оборудованием, позволяющим проводить углублённые исследования в сфере химии, физики и аэродинамики. Обеспечивается приоритетный доступ к исследовательским центрам армии Деда Мороза, включая доступ к установкам для экспериментов (например, аэротрубы). Обеспечивает работу 15 учёным. На низших этажах производится изучение биологических и механических существ в условиях карантина. #Уязвимость к бомбардировкам: нет";
	global.wikit31 = "Мастерская";
	global.wikit32 = "Инженерный подземный модуль, оснащённый новейшим производственным оборудованием, включающим самые последние техно-центры и станки с ЧПУ. Позволяет производить практически всю известную номенклатуру деталей и заготовок. Обеспечивает работу до 15 инженерам. Сборка особо крупных тел вращения осуществляется на автоматических токарно-карусельных станках на низших этажах. #Уязвимость к бомбардировкам: нет";
	global.wikit33 = "Склад";
	global.wikit34 = "Утилитарный подземный модуль, обеспечивающий хранение оборудования, техники и боеприпасов на различных этажах модуля. Для удобства транспортировки оборудован грузовым лифтом. #Уязвимость к бомбардировкам: нет";
	global.wikit35 = "Ангар";
	global.wikit36 = "Подземный модуль, обеспечивающий хранение до двух летательных аппаратов, их обслуживание и запуск. Выход на поверхность осуществляется с помощью грузового лифта, который доставляет самолёт на ВПП с электромагнитной катапультой. #Уязвимость к бомбардировкам: да";
	global.wikit37 = "РЛС";
	global.wikit38 = "Подземный модуль, оборудованный станцией РЛС. Доступ к поверхности осуществляется с помощью радио-линз и радиопрозрачного купола, замаскированного под снежное покрытие. Одна установка позволяет отслеживать до 150 км воздушного пространства вокруг, большее воличество установок позволяет увеличить дальность видимости радаров. К сожалению, невозможность вынести антенну на поверхность ограничивает максимальную дальность видимости и делает нецелесообразным размещением более трёх радаров одновременно. #Уязвимость к бомбардировкам: да";
	global.wikit39 = "Лазарет";
	global.wikit40 = "Медицинский подземный модуль, оснащённый по последнему слову техники и предназначенный для ускоренного излечения раненых. Строительство более одного лазарета нецелесообразно. #Уязвимость к бомбардировкам: нет";
	global.wikit41 = "ЗРК";
	global.wikit42 = "Подземный модуль, оснащённый пусковыми шахтами с переделанными ракетами РВВ-БД ''Стрела''. Берёт целеуказание с РЛС и атакует цель, если она пытается высадить войска рядом с базой. Строительство установки без РЛС не имеет смысла. Не атакует противника на карте мира, если база ещё не обнаружена. Большее число установок повышает надёжность ПВО. #Уязвимость к бомбардировкам: да";
	global.wikit43 = "''Х-Торнадо''";
	global.wikit44 = $"Скоростной многоцелевой истребитель, предназначенный для разведки и перехвата летательных аппаратов противника. Изначально был разработан для специальных задач и между тем скоростной переброски боевого звена. Очень быстрый. #Прочность: {global.planedata[3, 1]} #Скорость: {global.planedata[3, 6]} #Форсаж: {global.planedata[3, 7]} #Скорость поворота: {global.planedata[3, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[3, 14]} #Ускорение: {global.planedata[3, 15]} #Макс. высота: {global.planedata[3, 17]}";
	global.wikit45 = "XI-1 ''Ветер''";
	global.wikit46 = $"Многоцелевой истребитель армии Деда Мороза, разработанный при участии Тейлза, специально для перехвата роботизированных аппаратов в условиях Арктики. Участвовал в множестве инцидентов в Арктике. Оснащён новейшим турбореактивным двигателем и специально экранированными бортовыми системами. На данный момент несколько устарел. #Прочность: {global.planedata[1, 1]}  #Скорость: {global.planedata[1, 6]} #Форсаж: {global.planedata[1, 7]} #Скорость поворота: {global.planedata[1, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[1, 14]} #Ускорение: {global.planedata[1, 15]} #Макс. высота: {global.planedata[1, 17]}";
	global.wikit47 = "XI-2 ''Пингвин''";
	global.wikit48 = $"Глубокая модернизация истребителя ''Ветер'', созданная на основе комбинации новейших технологий и опыта борьбы с роботизированными летательными аппаратами. Использует импульсно-детонационный двигатель и экспериментальный радио-фотонный радар. Эффективен против большинства целей, но сохранил недостатки однодвигательной схемы. #Прочность: {global.planedata[2, 1]} #Скорость: {global.planedata[2, 6]} #Форсаж: {global.planedata[2, 7]} #Скорость поворота: {global.planedata[2, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[2, 14]} #Ускорение: {global.planedata[2, 15]} #Макс. высота: {global.planedata[2, 17]}";
	global.wikit49 = "XI-3 ''Альбатрос''";
	global.wikit50 = $"Новейший многоцелевой истребитель двухдвигательной схемы, комбинирующий достоинства трофейных сплавов с преимуществами двухдвигательной схемы. Усиленные трофейными сплавами импульсно-детонационные двигатели позволяют развивать самолёту огромную скорость и носить большую боевую нагрузку. Эффективен против любых целей. #Прочность: {global.planedata[4, 1]} #Скорость: {global.planedata[4, 6]} #Форсаж: {global.planedata[4, 7]} #Скорость поворота: {global.planedata[4, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[4, 14]} #Ускорение: {global.planedata[4, 15]} #Макс. высота: {global.planedata[4, 17]}";
	global.wikit51 = "XI-4 ''Фотон''";
	global.wikit52 = $"Передовой многоцелевой роботизированный истребитель двухдвигательной схемы, пилотируемый дистанционно или в автоматическом режиме. Лёгкий и прочный корпус из суперсплавов и двухдвигательная установка позволяют носить самолёту боевую нагрузку одновременно с мощным энергетическим излучателем, который позволяет эффективно атаковать воздушные цели. Излучатель продублирован для защиты от управляемого вооружения. #Прочность: {global.planedata[5, 1]} #Скорость: {global.planedata[5, 6]} #Форсаж: {global.planedata[5, 7]} #Скорость поворота: {global.planedata[5, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[5, 14]} #Ускорение: {global.planedata[5, 15]} #Макс. высота: {global.planedata[5, 17]}";
	global.wikit53 = "XI-5 МиГ-31AXE ''Полярный лис''";
	global.wikit54 = $"Тяжёлый перехватчик, разработанный на основе советского истребителя-перехватчика МиГ-31, созданный специально для использования тяжёлых ПКР ''Лавина''. Не способен к манёвренному ближнему бою, но способен развивать большую скорость и перевозить большую боевую нагрузку на солидные расстояния, а так же имеет мощный радар для самостоятельного обнаружения целей в воздухе. #Прочность: {global.planedata[6, 1]} #Скорость: {global.planedata[6, 6]} #Форсаж: {global.planedata[6, 7]} #Скорость поворота: {global.planedata[6, 8]} #Уклонение: нет #Дальность РЛС: {global.planedata[6, 14]} #Ускорение: {global.planedata[6, 15]} #Макс. высота: {global.planedata[6, 17]}";
	global.wikit55 = "XT-1 ''Скаут''";
	global.wikit56 = $"Транспортно-грузовой вертолёт, разработанный специально для суровых условий Арктики. Способен перевозить до 8 человек, включая груз. Чрезвычайно уязвим для вражеских истребителей, рекомендуется прикрытие с воздуха. #Прочность: {global.planedata[7, 1]} #Скорость: {global.planedata[7, 6]} #Форсаж: {global.planedata[7, 7]} #Скорость поворота: {global.planedata[7, 8]} #Уклонение: нет #Дальность РЛС: {global.planedata[7, 14]} #Ускорение: {global.planedata[7, 15]} #Макс. высота: {global.planedata[7, 17]}";
	global.wikit57 = "XT-2 СВВП ''Рейнджер''";
	global.wikit58 = $"Новейший Самолёт Вертикального Взлёта и Посадки, разработанный в рамках проекта X-MAS для скоростной перевозки в условиях арктики. Способен доставить до 12 солдат на поле боя, включая весь груз. Обладает чрезвычайно знакомым дизайном. #Прочность: {global.planedata[8, 1]} #Скорость: {global.planedata[8, 6]} #Форсаж: {global.planedata[8, 7]} #Скорость поворота: {global.planedata[8, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[8, 14]} #Ускорение: {global.planedata[8, 15]} #Макс. высота: {global.planedata[8, 17]}";
	global.wikit59 = "XT-3 конвертоплан ''Вихрь''";
	global.wikit60 = $"Передовой конвертоплан проекта X-MAS, способный к сверхскоростной доставке 20 солдат на поле боя. Обладает прекрасной грузоподъёмностью. #Прочность: {global.planedata[9, 1]} #Скорость: {global.planedata[9, 6]} #Форсаж: {global.planedata[9, 7]} #Скорость поворота: {global.planedata[9, 8]} #Уклонение: да #Дальность РЛС: {global.planedata[9, 14]} #Ускорение: {global.planedata[9, 15]} #Макс. высота: {global.planedata[9, 17]}";
	global.wikit61 = "E-104 (Разведчик)";
	global.wikit62 = $"Разведчик-робот империи Эггмана, оснащённый двигателем неизвестной конструкции, не оставляющий шлейфа и не потребляющий классическое для турбореактивной авиации топливо. Энергосистема запитывает энергетические импульсные излучатели и, судя по всему, плазменный двигатель. Фюзеляж состоит из титанового каркаса обшитого листами из неизвестного сплава. Первый летательный аппарат, обнаруженный проектом X-MAS. Предшествует появлению более серьёзных противников и занимается преимущественно разведкой. #Максимальная обнаруженная скорость: {global.eggplanedata[1, 7]} #Обнаруженное ускорение: {global.eggplanedata[1, 15]}";
	global.wikit63 = "E-140 (Истребитель)";
	global.wikit64 = $"Стандартный робот-перехватчик империи Эггмана. Скоростной и манёвренный, истребитель полагается исключительно на свой энергетический излучатель. Управляемого вооружения, как правило, не несёт. Обычно используется для завоевания воздушного превосходства. #Максимальная обнаруженная скорость: {global.eggplanedata[2, 7]} #Обнаруженное ускорение: {global.eggplanedata[2, 15]}";
	global.wikit65 = "E-201 (Перехватчик)";
	global.wikit66 = $"Элитный робот-перехватчик империи Эггмана. Способен развивать огромную скорость. В качестве вооружения использует сдвоенный энергетический излучатель и управляемое вооружение, кроме того, имеет оборонительное вооружение в виде турели с излучателем, которая уничтожает атакующие управляемые ракеты. Используется либо для завоевания воздушного превосходства, либо для защиты важных судов и объектов. #Максимальная обнаруженная скорость: {global.eggplanedata[3, 7]} #Обнаруженное ускорение: {global.eggplanedata[3, 15]}";
	global.wikit67 = "E-100 (Бомбардировщик)";
	global.wikit68 = $"Высотный бомбардировщик империи Эггмана, имеющий оборонительное вооружение и метающий плазменные заряды в качестве бомб. Довольно беззащитен против истребителей, но способен сбить тех из них, кто рискнёт вступить с ним в ближний бой. #Максимальная обнаруженная скорость: {global.eggplanedata[4, 7]} #Обнаруженное ускорение: {global.eggplanedata[4, 15]}";
	global.wikit69 = "E-150 (Штурмовик)";
	global.wikit70 = $"Штурмовик империи Эггмана, используемый для атаки объектов и поддержки сухопутных сил. Будучи небольшим и юрким, штурмовик в качестве вооружения имеет исключительно сдвоенный импульсный излучатель. Хотя внешне штурмовик выглядит уязвимым, на практике благодаря мощному вооружению и бронированию он довольно опасен для многих истребителей. #Максимальная обнаруженная скорость: {global.eggplanedata[5, 7]} #Обнаруженное ускорение: {global.eggplanedata[5, 15]}";
	global.wikit71 = "E-500 (Транспорт)";
	global.wikit72 = $"Стандартный транспортник империи Эггмана. Имеет оборонительное вооружение и используется для доставки роботов на различные боевые операции и доставки грузов. Требует серьёзного вооружения для уничтожения, так как лучевые плазменные турели судя по докладам пилотов наиболее смертоносны и эффективны против ракет. ";
	global.wikit73 = "''Непревзойдённый'' (Материнский корабль)";
	global.wikit74 = $"Огромный материнский корабль, способный к выходу в космос и являющийся мобильной базой Эггмана. Является местом нахождения самого Эггмана в данный момент. Корабль имеет прекрасную защиту и оборонительное вооружение, кроме того, вседа находится в сопровождении лучших перехватчиков империи. Не может быть легко сбит обычным вооружением. #Максимальная обнаруженная скорость: {global.eggplanedata[6, 7]} #Обнаруженное ускорение: {global.eggplanedata[6, 15]}";
	global.wikit75 = "Соник Ёж";
	global.wikit76 = "Лидер отряда проекта X-MAS, синий колючий ёж, самый быстрый в своём классе. Высокая скорость реакции позволяет ему с 50%-вероятностью избегать попадания снарядов, а скорость движения - создавать звуковую волну.";
	global.wikit77 = "Майлз 'Тейлз' Прауэр";
	global.wikit78 = "Инженер отряда проекта X-MAS, рыжий пушистый двухвостый лис, самый пушистый в своём классе. Неизвестным образом, умеет летать, чем часто пользуется. В качестве вооружения использует лазерный пистолет, использующий осколок изумруда (что делает его неповторимым) и дрон-беспилотник, который создан для отвлечения противника на поле боя.";
	global.wikit79 = "Эми Роуз";
	global.wikit80 = "Пулемётчик отряда проекта X-MAS, самый розовый в своём классе. Будучи беспощадной, использует утяжелённую кувалду и скорострельный многоствольный пулемёт в бою. В порыве ярости может превратиться в вихрь из ударов кувалдой.";
	global.wikit81 = "Руж Летучая Мышь";
	global.wikit82 = "Диверсант отряда проекта X-MAS. Умеет летать и производить самолечение. Профессиональная подготовка позволяет с 50%-вероятностью отражать удары в ближнем бою.";
	global.wikit83 = "Сильвер Ёж";
	global.wikit84 = "Техномаг отряда проекта X-MAS. Прекрасное оборудование неизвестного происхождения позволяет ему парализовывать и отталкивать противников в бою.";
	global.wikit85 = "Шэдоу Ёж";
	global.wikit86 = "Штурмовик отряда проекта X-MAS. Безжалостен и способен уничтожить любого в бою с помощью своего неизвестного оружия. Может телепортироваться и создавать шоковое поле.";
	global.wikit87 = "Снегопризывник";
	global.wikit88 = "Снеговик, призванный на службу в армию Деда Мороза. Древняя раса, которая поклялась в случае необходимости встать на защиту новогоднего праздника и самого Деда Мороза. Популяция снеговиков растёт преимущественно от промышленной лепки и от лепки силами людей. Только будучи в Арктике снеговики могут быть призваны на воинскую службу. Обладают всеми необходимыми для выполнения своих задач навыками, начиная от пилотирования и заканчивая владением оружием и навыками ведения общевойскового боя.";
	global.wikit89 = "Наклз Ехидна";
	global.wikit90 = "Сапёр проекта X-MAS. Прекрасный боец, способный закапываться и перемещаться под землёй, а так же производить минирование на местности.";
	global.wikit91 = "Металлический звук";
	global.wikit92 = "Быстрый и ловкий робот ближнего боя, часто встречаемый в небольших рейдах Эггмана. Турбореактивный двигатель в центре масс конструкции позволяет корректировать курс и скорость посадки во время десантирования с воздуха. Несмотря на защиту из прочных сплавов, уязвимые шарниры и сочленения в конструкции не обеспечивают должной защиты от кинетического оружия.#Из-за сложной конструкции используемые сплавы не могут быть легко сняты. #Защита - 10";
	global.wikit93 = "Пешка";
	global.wikit94 = "Грузный сферообразный робот, обладающий прекрасной защитой от кинетического оружия. К сожалению, закрытая конструкция и обшивка из особых сплавов делает робота невосприимчивым к большинству видов кинетического оружия. К счастью, хоть и с трудом, но робот всё ещё может быть уничтожен с помощью наших передовых крупнокалиберных винтовок. Способен к бою на любой дистанции, для чего имеет отстреливаемые гарпунные кисти и импульсные энергетические излучатели. #Так как основное количество сплавов находится в обычном сферическом бронепоясе их неповрежденная часть может быть легко снята. #Защита - 25";
	global.wikit95 = "НЛО";
	global.wikit96 = "Дискообразный левитирующий робот, обладающий прекрасной защитой, невосприимчивой ко всем видам ручного кинетического оружия. Левитационная установка робота позволяет роботу парить над поверхностью и игнорировать складки на местности и перепады высот. В качестве вооружения использует мощный сдвоенный импульсный излучатель плазмы, заряды которого при попадании производят тепловой взрыв. В качестве энергоустановки использует компактный реактор неизвестной конструкции который взрывается при повреждении из-за чего полезность обломков резко снижается. Крайне опасный противник. #Защита - 40";
	global.wikit97 = "Турель";
	global.wikit98 = "Автономная стационарная оборонительная турель с плазменным орудием по всей видимости выполняет роль первого контура защиты на сооружениях и крупных кораблях Эггмана. Её бронирование достаточно сильное чтобы быть непробиваемым для стрелкового вооружения, но недостаточное, чтобы полностью защищать турель от гранат и энергетического оружия.#Трофейные экземпляры дали некоторую ясность относительно их устройства. Как оказалось, турели полностью автономны и не полагаются на внешние источники энергии или связь, за селекцию и обнаружение целей у неё отвечает сложная оптико-локационная станция и адресный узконаправленный запросчик ''свой-чужой''. В случае, если предполагаемая цель не дает верный ответ на запрос или не отвечает, то турель отмечает эту цель как враждебную. Воссоздание такой турели слишком сложно для нашего технологического уровня, но трофейные экземпляры могут быть восстановлены и перепрошиты таким образом, чтобы логика атаки целей была инвертирована. Однако, ввиду сильных повреждений, источник энергии не может быть восстановлен, как и орудие, таким образом вооружение нашей версии турели будет заменено на лучевую пушку, а питание будет подаваться напрямую с базы. #Эти турели чрезвычайно опасны, но неэффективны на сложной местности, используйте укрытия и забрасывайте их гранатами за пределами их досягаемости!#Защита - 40";
	global.wikit99 = "Излучатель";
	global.wikit100 = "Как оказалось, в качестве основного дальнобойного оружия Эггман использует плазменное оружие различной конфигурации и мощности. Самая распространенная модель его энергетического излучателя, создан на основе сверхпроводников и представляет собой обыкновенный линейный магнитный ускоритель использующий магнитное поле для удержания и направления плазмы. Общий принцип стрельбы напоминает рельсотрон, причём сама плазма формируется в эмиттере мощным электрическим разрядом из газосмеси получаемой из атмосферного воздуха не используя отдельных боеприпасов. Требует приличной мощности источника энергии.#Из-за невозможности захватить исправный экземпляр нам не удается воссоздать полноценный работающий образец, так как формируемая нами плазма нестабильна и не может пролететь дальше пары десятков метров не распадаясь. Тем не менее на основе этого излучателя можно попробовать создать собственное лучевое оружие использующее иной принцип работы";
	global.wikit101 = "Суперсплав";
	global.wikit102 = "Уникальный композитный материал, не встречавшийся ранее и созданный с помощью электромагнитной и порошковой металлургии. В основе ''суперсплава'' лежит высоколегированная сталь. Далее эта сталь армируется композитом на основе углерода с тонким металлокерамическим слоем по своим свойствам напоминающим победит. Цельность конструкции достигается за счёт тонкой связывающей оболочки на основе кобальта и сложной термообработки. На удивление тонкие листы композита обладают умеренной гибкостью позволяющей придавать им сложные формы.#К сожалению, нам не удаётся воссоздать этот композит даже в лабораторных условиях, но мы можем использовать обломки, так как даже толстые и на вид единые композиты оказались лишь бронепакетами состоящими из тонких листов соединённых диффузионной сваркой";
	global.wikit103 = "Мотожук";
	global.wikit104 = "Небольшой робот из довольно распространённых сплавов, начиненный взрывчаткой. Опасен только на малой дистанции, где подрывает сам себя. К счастью, бесполезен в условиях резких перепадов высот.";
	global.wikit105 = "Штаб";
	global.wikit106 = "Командный подземный комплекс, обеспечивающий существование командного состава и удобство его работы в проекте X-MAS. Оборудование модуля включает в себя рабочие места командования и вспомогательного персонала, а так же голографическую карту Арктического полюса с отображением всех известных целей на ней. #Уязвимость к бомбардировкам: нет";
	global.wikit107 = "Шифрование передач Эггмана";
	global.wikit108 = "Сами по себе радиопередачи Эггмана не так сложно перехватить и периодически агентам проекта удается обнаружить их в радиоэфире благодаря чему можно обнаружить наличие поблизости неприятеля даже без покрытия зоны радиолокационными станциями. Однако содержание этих передач долгое время не удавалось понять.#Как оказалось, Эггман использует квантовую криптографию и сложную сеть ретрансляторов. Подобная система является невзламываемой на данном этапе технологического развития хотя бы в силу невозможности незаметно прослушать канал связи. К счастью, лазейка нашлась: ни один из кораблей или роботов Эггмана не связывается с центром напрямую. Таким образом, перепрошив трофейный ретранслятор (предварительно демонтированный с захваченного транспортного корабля Эггмана) мы можем получить исходящую информацию от любого корабля и тем самым узнать, например, его тип.#Тем не менее, полную информацию о деятельности корабля установить, к сожалению, невозможно, поскольку команды от центра передаются адресно и никогда не попадут на приёмник уже сбитого или списанного корабля...";
	global.wikit109 = "Модульные постройки";
	global.wikit110 = "Арктические условия делают возведение сооружений дорогостоящим и сложным делом. Из-за вечной мерзлоты даже создание фундамента становится сложным, так как по мере нагрева от теплопотерь здания лёд и мёрзлый грунт теряют несущую способность делая здание нестабильным. Отработанная технология возведения модульных построек позволила нам за приемлимые сроки и цену возводить небольшие автономные станции расширяющие зону деятельности проекта. Кроме того, удалось создать небольшие модульные производственные комплексы, которые позволят создать больше игрушек к новому году, что скажется на повышении финансирования проекта";
	global.wikit111 = "Бортовой детектор изумрудов";
	global.wikit112 = "Несмотря на то, что многие мобианские технологии неприменимы на Земле, тем не менее, оказалось, что при использовании ряда уловок адаптировать детектор хаос-изумрудов под земные условия несложно. Хотя электромагнитные возмущения создаваемые хаос-изумрудом в земных условиях нелегко обнаружить с большой высоты, было обнаружено, что радиосигнал отражаемый РЛС получает сильные помехи вызванные таким источником выражающиеся в нестабильности доплеровской картины.#Обычно фильтр РЛС отсеивает такие возмущения как обычные помехи вызванные сложным ландшафтом, однако в обновленной конфигурации при совпадении определённых паттернов (которые, тем не менее, могут быть выявлены не мгновенно) РЛС сообщает о наличии хаос-изумруда поблизости";
	global.wikit113 = "РВВ БД Р-03 ''Зилот''";
	global.wikit114 = "С момента начала работы проекта мы всё чаще сталкиваемся с численным превосходством авиации противника. Поскольку нет никаких оснований считать, что в дальейшем это превосходство удастся нивелировать, то приходится искать другие способы противодействия противнику. Ракета Воздух-Воздух Большой Дальности ''Зилот'' оказалась удачным примером такого способа: созданная на основе РВВ СД ''Скат'' и использующая твердотопливный двигатель от РВВ БД ''Стрела'' данная ракета использует фугасную боеголовку и головную часть с отделяемыми микроракетами оптического наведения со стержневыми боеголовками. Благодаря этому ракета наиболее эффективна при использовании против плотных авиагрупп противника на большом расстоянии, так как атакуя основную цель ракета отстреливает микроракеты по соседним с ней враждебным целям.#К сожалению, ракета дорогая, использует полуактивное наведение и неспособна атаковать микроракетами не находящиеся рядом с целью самолёты из-за слабых двигателей, а большой вес ракеты не позволяет подвесить более двух штук на подвеску#Дальность - 200";
	global.wikit115 = "Улучшенная авиапушка";
	global.wikit116 = "Используемая проектом X-MAS модель авиапушки обладает высокой скорострельностью и достаточно мощная чтобы наносить урон всем известным воздушным суднам Эггмана. Тем не менее, как оказалось, применение авиапушек крайне затруднено из-за того, что любое оружие Эггмана превосходит его по дальности применения. К счастью, используя трофейные материалы можно частично нивелировать этот недостаток при сохранении габаритов повысив давление в пороховой камере и стволах установки, благодаря чему снарядам придаётся более высокая скорость вследствие чего растут их урон и эффективная дальность применения. Однако, ввиду возросшей отдачи пришлось снизить скорострельность установки во избежание сваливания самолёта в процессе непрерывной стрельбы#Дальность - 50";
	global.wikit117 = "Улучшенные методы обнаружения";
	global.wikit118 = "С самого начала работы проекта мы столкнулись со сложностью при обнаружении авиации Эггмана. Несмотря на снятие радиопортретов, частота обнаружения кораблей не росла, так как даже у кораблей одной и той же модели они не совпадали. Наконец, причина была найдена: как выяснилось при изучении большого количества обломков кораблей разных классов, Эггман использует сложную систему динамичных радиолинз, которые постоянно меняют радиопрофиль самолета под наиболее выгодный в текущий момент, причём необязательно малозаметный. Таким образом, Эггман не давал возможность выявлять характерные радиопортреты и при этом затруднял обнаружение маскируя радиопрофиль под ближайший к нему отражающий радиоволны объект, будь то другой самолёт или плотный грозовой облачный массив.#Обнаружив эту закономерность, мы не можем полностью нивелировать эту технологию, но, тем не менее, скорость обнаружения цели определённо будет повышена за счёт адаптивного фильтра отраженного сигнала";
	global.wikit119 = "Робототехника Эггмана";
	global.wikit120 = "После изучения множества обломков роботов первичный оптимизм относительно поиска решения всех проблем быстро рассеялся: стало ясно, что мы едва ли можем даже просто воссоздать одну из этих машин, не говоря уже о превентивном выводе их из строя с помощью уязвимости. Робототехника Эггмана отличается высокой автономностью и неприхотливостью, несмотря на местами причудливый дизайн, архитектура каждого робота хорошо продумана. Помимо хорошо защищенных и надежных серводвигателей каждый робот обладает мощной оптической локационной станцией обладающей всеракурсным обзором, что объясняет зоркость и наблюдательность роботов.#Самой главной проблемой оказался тот факт, что несмотря на высокую автономность робот к удивлению не имеет мощных вычислительных мощностей для принятия сложных решений и точной обработки всей информации. Судя по всему, мы имеем дело по большей части с интерфейсом, который во многом полагается на централизованный сервер. Очевидно, такое пусть и рациональное решение обладает рядом недостатков, но зато оно не даёт противнику вроде нас скопировать технологию. Тем не менее, возможно, это наш шанс: если мы сможем обнаружить и уничтожить такой центр, возможно, мы сможем выиграть эту войну...";
	global.wikit121 = "Окончательное решение проблемы";
	global.wikit122 = "Судя по всему мы наконец смогли найти выйти из сложившейся патовой ситуации. Как оказалось, наши первоначальные догадки оказались верны: вся робототехника Эггмана опирается на централизованный сервер который ожидаемо находится на материнском корабле. Сама по себе эта информация не несёт большой ценности поскольку мы до сих пор не могли обнаружить этот корабль, но теперь нам это и не нужно. Поскольку мы до сих пор не обнаружили более 4 изумрудов, очевидно, что 3 других скорее всего являются частью энергетической установки корабля Эггмана. Подобное нередко применялось им ранее и потому правильность гипотезы скорее всего оправдается. Благодаря этому мы можем воспользоваться способностью хаос-изумрудов к резонансу на большом расстоянии и собрать резонирующий реактор из трёх изумрудов спровоцировав их каскадную перегрузку энергосетей и потенциально дальнейший взрывной выброс изумрудов на большое расстояние друг от друга. Строительство такого реактора возможно в разумные сроки лишь на нашей базе, но, к счастью, много места это не займет и опасности самой базе это представлять не будет при соблюдении всех мер безопасности, благо наша база укреплена и расположена под землёй.#Подобное должно привести к уничтожению или крушению материнского корабля, но можно быть уверенным, что Эггман быстро обнаружит работу такого реактора по характерным возмущениям и их источник и потому атакует нашу базу всем, что у него есть, включая материнский корабль. Таким образом, не стоит строить реактор до тех пор, пока мы не будем готовы к финальной битве...";
	global.wikit123 = "Лучевое энергооружие";
	global.wikit124 = "Первоначальная оценка оказалась верной: на основе излучателя действительно можно разработать собственное лучевое энергооружие. Во-первых нужно внести ясность: это НЕ очередной фотонный лазер. Классический лазер крайне неэффективен в условиях атмосферы, имеет потолок мощности из-за нагрева атмосферного воздуха до состояния плазмы лучом и быстро рассеивается с ростом расстояния. Альтернативой стало импульсное инфракрасное лучевое оружие, которое стало возможно благодаря использованию трофейного излучателя. Оно как и обычный лазер излучает видимый световой поток из-за создания кратковременным мощным импульсом видимого суперконтинуального свечения, но не подвержено таким строгим ограничениям и более эффективно передаёт энергию.#Так как это не кинетическое оружие, то оно будет разрушать броню тепловым ударом и бронированные противники не будут более такой серьёзной проблемой, как раньше, но дороговизна и низкая скорострельность могут не позволить массово перевооружить всех бойцов на него";
	global.wikit125 = "Хаос-резонатор";
	global.wikit126 = "Экспериментальный резонатор хаос-изумрудов предназначенный для перегрузки энергосети материнского корабля Эггмана. Постройте его для инициации финального сражения, но будьте готовы к нему! #Уязвимость к бомбардировкам: да";
	global.wikit127 = "";
	global.wikit128 = "";
	global.wikit129 = "";
	global.wikit130 = "";
	global.wikit131 = "";
	global.wikit132 = "";
	global.wikit133 = "";
	global.wikit134 = "";
	global.wikit135 = "";
	global.wikit136 = "";
	global.wikit137 = "";
	global.wikit138 = "";
	global.wikit139 = "";
	global.wikit140 = "";
	global.wikit141 = "Основы: строительство базы";
	global.wikit142 = "Проект X-MAS располагает ресурсами на строительство лишь одной базы. Ввиду малой площади района операции строительство других полноценных баз признано нецелесообразно. По умолчанию месторасположение базы неизвестно противнику, так как база скрыта от внешнего наблюдения и использует распределенную сеть радиоретрансляторов. Тем не менее, противник может обнаружить базу пролетая над ней. Делайте планировку базы с умом, так как в случае бомбардировок соседние с атакуемым модулем (особенно с ангарами) модули могут быть повреждены.#Финансирование проекта X-MAS и подведение итогов происходят каждую неделю.";
	global.wikit143 = "Основы: проект X-MAS";
	global.wikit144 = "Проект X-MAS входит в состав армии Деда Мороза в качестве отдельной автономной армии и подчиняется напрямую Деду Морозу.#Финансирование проекта зависит напрямую от его эффективности, так как по мере уничтожения объектов Деда Мороза его возможности по вашей поддержке падают. Задачей проекта является предотвращение деятельности Др. Эггмана на Северном Полюсе. Старайтесь держать оптимальное число ученых и инженеров на базе, чтобы своевременно выполнять нужные вам проекты и при этом не перерасходовать бюджет";
	global.wikit145 = "Основы: обслуживание и использовании авиации";
	global.wikit146 = "Авиация является основной силой проекта X-MAS. Увеличение численности самолетов возможно увеличением числа ангаров и дозаказа самолётов. Снаряжение каждого самолёта может быть изменено в окне ''Подробно'' во вкладке ''Авиация''. Так же каждый самолет может быть переименован в этом же окне нажатием на кнопку с названием самолета. Каждый самолет по мере необходимости проходит дозаправку, перевооружение и ремонт, которые не могут быть прекращены немедленно. С умом выбирайте вооружение самолёта, так как оно не может быть изменено мгновенно. Если вам не хватает дальности самолетов, то заменяйте их на более новые модели или используйте подвесные топливные баки";
	global.wikit147 = "Основы: карта мира";
	global.wikit148 = "На карте мира показан операционный регион Северного Полюса с указанием важных для проекта точек интереса, таких как крупных предприятий и населенных пунктов принадлежащих Деду Морозу. Кроме них на карте отображаются обнаруженные силы противника и доклады о его деятельности, если таковые есть. Перехват обнаруженных эскадрилий противника может быть осуществлен кнопкой ''Перехват'' в меню или в окне информации об НЛО после их обнаружения. Кроме того, на карте мира можно посмотреть сообщения и ускорить время.#Покрывайте территорию радарами и системами ПВО для обнаружения и пассивного уничтожения противника, а так же подавляйте его попытки разрушить или разбомбить важные нам объекты";
	global.wikit149 = "Основы: строительство на поверхности";
	global.wikit150 = "После разработки модульных построек открывается возможность сооружать отдельные постройки на карте мира с помощью кнопки ''Строить'' на карте мира. Строительство фабрик позволяет увеличить финансирование в перспективе, радары - увеличить радарное покрытие, а системы ПВО атаковать обнаруженные эскадрильи противника.#Имейте ввиду, что ПВО может атаковать лишь обнаруженные радарами цели, а любые объекты на карте могут быть атакованы авиацией противника. Таким образом, необходимо прикрытие всех важных объектов системами ПВО и радарами, особенно если ваша авиация численно уступает противнику";
	global.wikit151 = "Основы: солдаты";
	global.wikit152 = "Солдаты проекта X-MAS состоят как из уникальных героев (такие, как Соник), так и из регулярной армии Деда Мороза. Регулярная пехота не отличается силой, но быстро накапливает опыт, может использовать разное вооружение и бросать гранаты, так же эти солдаты могут быть быстро заменены. Уникальные же герои не так универсальны и не могут быть заменены в случае, если они погибнут.#В случае, если солдаты получат ранение в бою они будут проходить лечение на базе без возможности их использовать до их излечения. Снаряжение солдат может быть изменено в окне ''Подробно'' во вкладке ''Пехота''. Каждого солдата так же можно переименовать. Убитые солдаты находятся во вкладке ''Мемориал''.#Всегда имейте готовый гарнизон на базе на случай если противник решит вас атаковать!";
	global.wikit153 = "Основы: наземный бой";
	global.wikit154 = "Наземный бой отличается длительностью и динамичностью. Первым (в случае его отсутствия) высаживается солдат управляемый игроком, причем его присутствие обязательно и при его смерти бой не продолжится пока не будет высажена замена. В качестве союзников могут быть высажены любые другие солдаты, но вести себя они будут уже не так эффективно. Использование суперспособностей происходит на клавиши ALT и CTRL, а на F1 - лечение и F2 - бросок гранаты (требуется регулярный солдат на поле боя). Прыжки происходят на пробел, а передвижение на WASD. Ближний бой происходит на клавишу F, а рывок на клавишу Shift.#Если вы испытываете особые сложности с выполнением миссии, а её выполнение необходимо, при этом число противников на миссии ограничено, попробуйте нанести предварительный авиаудар по цели.";
	global.wikit155 = "Основы: взаимодействие с армией Деда Мороза";
	global.wikit156 = "Проект X-MAS ведёт войну не в одиночку, а в составе армии Деда Мороза, которая ведёт самостоятельную борьбу за спасение нового года. Вы можете не видеть всех операций вашего союзника, но он будет поддерживать вас там, где может. Кроме того, некоторые ваши технологические разработки могут быть им использованы при наличии достаточного числа ресурсов для этого, что является дополнительным стимулом минимизировать деятельность противника на операционном театре. Чаще всего союзник будет помогать при атаках на его собственные объекты, но он так же может и самостоятельно перехватывать эскадрильи противника";
	global.wikit157 = "Основы: воздушный бой";
	global.wikit158 = "Воздушный бой отличается скоротечностью и сложностью. Правильно оценивайте свои силы, если видите, что силы не равны, лучше ударить и отступить или покинуть бой сразу же, поскольку потерять дорогостоющий самолет может быть непозволительнойй роскошью. В случае, если вы уверены в своей победе или потери вам не страшны вы можете пропустить воздушный бой нажав ''Автобой'' рассчитав его итоги автоматически, в ином случае вам придется сражаться вручную. Правильно подбирайте вооружение самолетов, бомбардировщики могут быть опасны в ближнем бою, но хорошо сбиваться ракетами большой дальности, тогда как против истребителей эффективнее всего могут быть ракеты ближнего боя и авиапушки.#Следите за своим транспортом, если противник его собъет при перехвате вы потеряете не только его, но и перевозимую им пехоту!";

	
	global.mail[0] = 0;
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "У меня украли чили-доги", 
		from: "Неслух Ёжик", 
		to: "Верховный главнокомандующий", 
		text: "Начальник! Кто-то внаглую стырил мои чили-доги из холодильника! Нужно немедленно их вернуть!", 
		available: false,
		order_number: -1
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Самоуверенный олух", 
		from: "Самый гениальный доктор на целом свете", 
		to: "Верховный гавнокомандующий", 
		text: "Надо же, стоило мне поставить под угрозу празднование нового года, так надоедливый грызун и его прихвостень тут как тут! Неужели вы думаете, что это не было частью моего гениального плана? Ты просто самоуверенный олух, если возомнил себе, что в состоянии остановить меня!", 
		available: false, 
		order_number: -1
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "БЕЗРУКИЙ ИДИОТ!", 
		from: "Эми Роуз", 
		to: "БЕЗРУКИЙ ИДИОТ!", 
		text: "БЕЗРУКИЙ ИДИОТ! КАКИМ ОБРАЗОМ ТЫ ДОПУСТИЛ СМЕРТЬ МОЕГО БЕДНОГО СИНЕГО ЁЖИКА?! КАКИМ ОБРАЗОМ ТЫ ЗАНЯЛ СВОЙ ВЫСОКИЙ ПОСТ? ПОДОЖДИ, Я ДОБЕРУСЬ ДО ТЕБЯ!", 
		available: false, 
		order_number: -1
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Х-Торнадо", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Не могу не признать, что я крайне разочарован потерей моего самолёта. Это была моя гордость, а теперь обломки моей гордости дымятся посреди бескрайних льдов... К сожалению, на его восстановление уйдут годы и то, если я смогу воссоздать его уникальные механизмы. #Что-ж, может быть, это... необходимость? Новая страница в бесконечной войне с Эггманом? Я думаю, вывод только предстоит сделать.", 
		available: false, 
		order_number: -1
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "У ВАС НАВЕРНОЕ ВЕСЕЛО", 
		from: "Тэнгл", 
		to: "Друзья", 
		text: "Ну блин! Почему каждый раз, когда вы веселитесь, меня рядом нет? Принесите хоть сувенирчик! И замочите пару роботов за меня!#Ну почему меня взяяялиии (;_;)#Впрочем, зато вы никогда не поверите что здесь сейчас творится :D", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "С заступлением на службу!", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Здравствуй, дорогой товарищ! Не забывай периодически проверять почту. Иногда я засылаю рабочую корреспонденцию, а иногда тебе может написать кто-нибудь из членов твоей команды. Удачи тебе в твоём начинании! Я очень надеюсь, что нам удастся спасти праздник...", 
		available: true, 
		order_number: 1
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Небольшая численность", 
		from: "Снег Морозов", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ командир! Я понимаю, мы - элитный отряд, а не армия, но я вынужден заметить, что численность солдат на базе крайне мала. Мы не сможем защитить базу, если на неё нападут когда наш отряд будет на задании. Я считаю нужно как можно скорее найти других хороших снеговиков и поставить их под ружье на базе.", 
		available: true, 
		order_number: 2 
	};
	global.mail[0]++; // 8
	global.mail[global.mail[0]] = 
	{ 
		header: "IQ300 МУВ", 
		from: "IQ300PROF", 
		to: "Главый осёл этого года", 
		text: "Я просто не могу поверить как такого кретина, как ты, могли поставить на пост командующего таким важным с их точки зрения проектом. С другой стороны, чему я удивляюсь? Они же идиоты. Пока ты, осёл, занимался не пойми чем, я собрал достаточно изумрудов, чтобы собрать новый корабль-носитель и отправить его разрушать города здесь и сейчас! #ТЫ НАВСЕГДА ОСТАНЕШЬСЯ В СТАРОМ ГОДУ!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 9
	global.mail[global.mail[0]] = 
	{ 
		header: "ЭТО БЫЛА ПОСЛЕДНЯЯ ПОБЕДА В ТВОЕЙ ЖИЗНИ!", 
		from: "ТВОЙ НОВЫЙ ГЕНИАЛЬНЫЙ ВРАГ КОТОРОГО ТЫ БУДЕШЬ МОЛИТЬ О ПОЩАДЕ", 
		to: "ЖАЛКИЙ СЛИЗНЯК", 
		text: "ТЫ.#ТЫ ПРОСТО НЕ ПРЕДСТАВЛЯЕШЬ, КАК ТЫ ВЫВЕЛ МЕНЯ ИЗ СЕБЯ!#КАК ТЫ СМОГ УНИЧТОЖИТЬ МОЮ НЕСОКРУШИМУЮ ЭСКАДРИЛЬЮ СУДНОГО ДНЯ?! ЗАПОМНИ, ЩЕНОК, ЭТО БУДЕТ ПОСЛЕДНЯЯ ПОБЕДА В ТВОЕЙ ЖИЗНИ, ПОСЛЕДНЕЕ РАДОСТНОЕ МГНОВЕНИЕ, КОТОРОЕ ТЫ ОЩУТИШЬ В ЭТОЙ ЖИЗНИ, С ЭТОГО МОМЕНТА Я УСТРОЮ ТЕБЕ НАСТОЯЩИЙ АД, ЗАПОМНИ ЭТОТ МОМЕНТ, ПОТОМУ ЧТО ОН СТАЛ ПОВОРОТНЫМ В ТВОЕЙ ЖИЗНИ!#Чёрт, мне нужно перестать предупреждать всех о своих планах... ", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 10
	global.mail[global.mail[0]] = 
	{ 
		header: "НЕ ПЫТАЙСЯ КРЫСИТЬ", 
		from: "ГЕНИЙ ЭТОГО ГОДА", 
		to: "ЖУЛИК-НЕУДАЧНИК", 
		text: "ЖАЛКАЯ КРЫСА! Неужели ты подумал, что сможешь в тайне от меня построить резонатор хаос-изумрудов?! Думаешь, я такой тупой?! Я прекрасно знаю что ты собираешься сейчас сделать!#Мольбы о пощаде не помогут!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 11
	global.mail[global.mail[0]] = 
	{ 
		header: "ЭТО ЕЩЁ НЕ КОНЕЦ", 
		from: "ТВОЯ СМЕРТЬ", 
		to: "ВЕЗУЧИЙ ДУРАК", 
		text: "Я ПРОСТО НЕ МОГУ ПОВЕРИТЬ, ЧТО ТЫ СМОГ ЗАКОНЧИТЬ СТРОИТЕЛЬСТВО РЕЗОНАТОРА! ЗАПОМНИ, НЕДОУМОК! Я СРАВНЯЮ ЗДЕСЬ ВСЁ С ЗЕМЛЁЙ ПРЕЖДЕ, ЧЕМ ТЫ ВООБЩЕ СМОЖЕШЬ ЕГО ВКЛЮЧИТЬ! ДАЖЕ НЕ ПЫТАЙСЯ ОСТАНОВИТЬ МЕНЯ! ТЫ ПРОИГРАЕШЬ, ПРОИГРАЕШЬ, ПРОИГРАЕШЬ!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 12
	global.mail[global.mail[0]] = 
	{ 
		header: "СУДНЫЙ ДЕНЬ", 
		from: "ТВОЙ АНГЕЛ СМЕРТИ", 
		to: "ХИТРЫЙ ПОДЛЕЦ", 
		text: "Я НЕ МОГУ ПОВЕРИТЬ, ЧТО ТЫ СМОГ ПОСТРОИТЬ РЕЗОНАТОР В ТАЙНЕ ОТ МЕНЯ! Отдаю должное, но КАКОЙ ЖЕ ТЫ ГЛУПЕЦ! ТЕПЕРЬ Я ЗНАЮ, ГДЕ ТВОЯ БАЗА! ЭТО ПОСЛЕДНЯЯ ПОБЕДА В ТВОЕЙ ЖИЗНИ, ПОПРОЩАЙСЯ СО ВСЕМИ И ОСОБЕННО С НОВЫМ ГОДОМ!#Праздник к нам приходит...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "АХАХАХАХААХАХ", 
		from: "ГЕНИЙ КОТОРОМУ ТЫ И В УЧЕНИКИ НЕ ГОДИШЬСЯ", 
		to: "МИСТЕР КРИВЫЕ РУКИ", 
		text: "Ты просто чудо. Благодаря тебе, сегодня великий праздник. Я наконец-то прищучил этого наглого синего грызуна. Жду не дождусь когда тебя сожрут с потрохами свои же 'друзья'.#Может быть, я даже дарую тебе быструю смерть или превращу в личного робота-слугу, когда придет время...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Нужно усилить противовоздушную оборону базы", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Я тщательно наблюдал за бомбардировкой базы проекта. К счастью, наша ставка на подземный укреплённый комплекс оправдала себя и она выдержала удар, с потерями или без. Тем не менее, я думаю, нам не нужно испытывать свою удачу. Я предлагаю установить на базе батареи ПВО. Решение за вами, товарищ, но я поступил бы так же.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 15
	global.mail[global.mail[0]] = 
	{ 
		header: "Не умеешь играть в прятки - не пытайся", 
		from: "Самый умный человек во всей вселенной", 
		to: "Недальновидный глупец", 
		text: "Я просто не могу поверить тому, что я так быстро нашел твою базу. Запомни, неудачник: не умеешь играть в прятки - не играй. Не позорься.#Теперь не удивляйся, если я решу зайти к тебе в гости.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Крепкий орешек", 
		from: "Гениальный ниндзя", 
		to: "Самоуверенный лопух", 
		text: "Грм! Твоя база оказалась крепче, чем я думал! Тем не менее не надейся, что такая дерзость легко сойдет тебе с рук! То, что нельзя уничтожить, можно захватить. Подумай об этом на досуге.#P.S: Тебе всё равно меня не победить.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Очень крепкий орешек", 
		from: "SuperProf", 
		to: "Поверивший в себя неудачник", 
		text: "Я ПРОСТО НЕ МОГУ ПОВЕРИТЬ, ЧТО ТЕБЕ УДАЛОСЬ ОТБИТЬ МОЁ ГЕНИАЛЬНО СПЛАНИРОВАННОЕ ВТОРЖЕНИЕ!#В любом случае, не надейся, что твоё везение продлится долго. Даже синяя крыса и его лесные друзья тебе не помогут победить в этой войне.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 18
	global.mail[global.mail[0]] = 
	{ 
		header: "Возмутительная наглость", 
		from: "Тот, кто умнее тебя", 
		to: "Тому, кто глупее меня", 
		text: "Ну и ну! Ты ещё имеешь наглость наносить ответные удары и захватывать мои аванпосты! Не рассчитывай, что это сойдет тебе с рук!#Даже если ты будешь высаживать на каждый мой аванпост армию синих грызунов я построю аванпостов больше, чем ты сможешь себе представить!#Запомни это!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "У меня украли мятные конфеты", 
		from: "Рыжий пушистый лисохвост", 
		to: "Верховный главнокомандующий", 
		text: "Командир! Что за бардак у нас в пищеблоке? Стоило мне оставить без присмотра на пять минут свои мятные конфеты, как они тут же исчезли, словно я в студенческом общежитии!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 20
	global.mail[global.mail[0]] = 
	{ 
		header: "Нужно атаковать недавно обнаруженный аванпост", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ, я нахожу новость о том, что Эггман построил здесь аванпост довольно тревожной. С помощью таких наземных аванпостов он может свободно атаковать все мои грузовые конвои и вести скрытное наблюдение. Необходимо как можно скорее его уничтожить, я со своей стороны выделю дополнительных солдат в поддержку такой миссии, как только она начнется...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Модернизация авиапарка регулярной армии", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ, рад сообщить, что мне наконец удалось выделить ресурсы на модернизацию авиапарка по разработанным твоей командой глубокой модернизацией самолёта ''Ветер''. Несомненно, это серьёзно расширит возможности регулярной армии по противостоянию агрессии доктора Эггмана.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Новые фабрики для производства игрушек", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ, рад сообщить, что построенная на ресурсы проекта фабрика уже приступила к работе. Поскольку это расширение производственных мощностей не было запланировано теперь я смогу выделять больше ресурсов на проект X-MAS. Имей ввиду, что если ты построишь больше таких фабрик, я смогу выделять ещёё больше ресурсов, но не потеряй их! Мне так же придется компенсировать потери, если их уничтожат. План по производству игрушек обязан быть выполнен!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Это только начало", 
		from: "Умнейшая форма жизни", 
		to: "Гавнокомандующий", 
		text: "Ха! Запомни, щенок: это только начало. Не надейся, что это последний объект, который вы потеряете в этой войне. Я разрушу всё до основания и сотру в порошок всех, кто смеет мне препятствовать. Ваши жалки потуги никому ничего не докажут.#Даже не пытайся меня остановить.#Не позорься.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 24
	global.mail[global.mail[0]] = 
	{ 
		header: "Отключение света", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Упс! Это была моя вина, прошу прощения...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Отключение света. Снова", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Да-да. Знаю. Виноват.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 26
	global.mail[global.mail[0]] = 
	{ 
		header: "Миссия: остановить Эггмана 1", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ главнокомандующий, я думаю, что если мы не хотим тыкаться в попытках решить нашу проблему словно слепые котята, нам придется рано или поздно найти способ получить доступ к более-менее целому сбитому кораблю и изучить как можно больше роботов.#Из дымящихся обломков невозможно узнать что-то действительно полезное...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Миссия: остановить Эггмана 2", 
		from: "Летучая мышь Руж", 
		to: "Верховный главнокомандующий", 
		text: "Дорогой, я слышала, что наш общий лысый знакомый рыщет где-то здесь в поисках хаос-изумруда. Я действительно буду расстроена, если такой красивый камень пройдёт мимо меня...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Миссия: остановить Эггмана 3", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ главнокомандующий, это отличная новость, что нам удалось раздобыть более-менее целый корабль Эггмана. После первичного осмотра стало ясно, что как минимум антенна на корабле может пролить некоторый свет на то, что можно предпринять, чтобы остановить Эггмана...#Моя текущая догадка всё ещё состоит в том, что Эггман снова соорудил материнский корабль и летает где-то неподалёку...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Миссия: остановить Эггмана 4", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ главнокомандующий, похоже, надежды на трофейный корабль не слишком оправдались. Тем не менее судя по всему Эггман действительно соорудил материнский корабль. Я бы предложил собрать хаос-изумруды и посмотреть, сможем ли мы что-нибудь с этим сделать...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 30
	global.mail[global.mail[0]] = 
	{ 
		header: "Миссия: остановить Эггмана 5", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ главнокомандующий, раз мы нашли способ выманить Эггмана, я бы предложил не спешить с решением. Нужно собрать хорошую эскадрилью и вооружить её по последнему слову техники. Эггман уже показал, что наскоком нам его не победить в этой кампании...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "ОБЪЯВЛЕНИЕ", 
		from: "КручеЧемЭйнштейн", 
		to: "Верховный главнокомандующий", 
		text: "Му-ха-ха-ха-ха! Ты даже не представляешь, слизень, какой гениальный план только что пришел мне в голову...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Мастер-изумруд", 
		from: "Ехидна Наклз", 
		to: "Верховный главнокомандующий", 
		text: "Я очень надеюсь, что когда я вернусь с мастер-изумрудом все будет в порядке, потому что у меня ощущение, что это будет не так...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "Хм.", 
		from: "Тень Ежа", 
		to: "Верховный главнокомандующий", 
		text: "Хм.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++;
	global.mail[global.mail[0]] = 
	{ 
		header: "КТО ТРОГАЛ МОЙ МОЛОТ?!", 
		from: "Эми Роуз", 
		to: "Все", 
		text: "ВНИМАНИЕ! Если кто-то ещё хотя бы РАЗ попробует дотронутся до моего молота без моего разрешения получит этим молотом себе по БАШКЕ!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 35
	global.mail[global.mail[0]] = 
	{ 
		header: "Снегопризывники докладывают", 
		from: "Обслуживающий персонал базы", 
		to: "Верховный главнокомандующий", 
		text: "Обслуживающий персонал базы докладывает: рыжих пушистых двухвостых лисохвостов можно и нужно тискать! Они очень мягкие...#А вот ежики колючие и пыхтят.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 36
	global.mail[global.mail[0]] = 
	{ 
		header: "Ёжик", 
		from: "Пушкин", 
		to: "Ёжики", 
		text: "Ёжик, ёжик, ты колюч!#Ты заколешь стаю туч!#Ты заколешь сине море,#Ты заколешь все просторы,#Не боишься никого!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 37
	global.mail[global.mail[0]] = 
	{ 
		header: "Лемур", 
		from: "Пушкин", 
		to: "Лемуры", 
		text: "Лемур, лемур, ты пушист!,#Хвост полосатый, хвост речист!#Это вовсе не хвосток -#Это лапка для мордок!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 38
	global.mail[global.mail[0]] = 
	{ 
		header: "Оценка обстановки", 
		from: "Виспер", 
		to: "Верховный главнокомандующий", 
		text: "Ауф.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 39
	global.mail[global.mail[0]] = 
	{ 
		header: "Прогноз", 
		from: "Виспер", 
		to: "Верховный главнокомандующий", 
		text: "Вуф.", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 40
	global.mail[global.mail[0]] = 
	{ 
		header: "Бомбардировка городов", 
		from: "Дед Мороз", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ, я рад, что удалось столь быстро и без потерь с вашей стороны ликвидировать террор на моих объектах, но имейте ввиду, что я не одобряю такой метод работы. Подобные бомбардировки неизбежно повреждают мои объекты, что на руку Эггману. Постарайтесь избегать подобного метода решения проблем когда дело касается моих предприятий...", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 41
	global.mail[global.mail[0]] = 
	{ 
		header: "Яблоки", 
		from: "Серебро Ёжик", 
		to: "Верховный главнокомандующий", 
		text: "Я хочу яблоки. Нет, не так: Я. ХОЧУ. ЯБЛОКИ! А на северном полюсе яблок нет! В общем, я ушёл за яблоками!", 
		available: false, 
		order_number: -1 
	};
	global.mail[0]++; // 42
	global.mail[global.mail[0]] = 
	{ 
		header: "Захват транспорта", 
		from: "Майлз Прауер", 
		to: "Верховный главнокомандующий", 
		text: "Товарищ главнокомандующий, транспорт, который мы недавно сбили, выглядит подходящим для того чтобы попытаться найти на нём аппаратуру для связи. Моё лисиное чутье и технические знания подсказывают что для координации сухопутных сил ему непременно пришлось бы обеспечить их связью. Не факт, что нам получится захватить обломки подходящего качества с первого раза, но нужно пытаться", 
		available: false, 
		order_number: -1 
	};
	
	
	

	global.map_messages_text_1 = "Не забудьте проверить почту!";
	global.map_messages_text_2 = "Пробная диагностика завершена. Все системы базы в норме.";
	global.map_messages_text_3 = "Для изучения доступны новые технологии!";
	global.map_messages_text_4 = "Для производства доступны новые чертежи!";
	global.map_messages_text_5 = "Доступны новые письма!";
	global.map_messages_text_6 = "Мы потеряли объект ";
	global.map_messages_text_7 = "Наши агенты докладывают, что скорее всего где-то выпал изумруд";
	global.map_messages_text_8 = "Пехоте не хватает боеприпасов!";
	global.map_messages_text_9 = "";
	global.map_messages_text_10 = "";
	global.map_messages_text_11 = "";
	global.map_messages_text_12 = "";
	global.map_messages_text_13 = "";
	global.map_messages_text_14 = "";
	global.map_messages_text_15 = "";
	global.map_messages_text_16 = "";
	global.map_messages_text_17 = "";
	global.map_messages_text_18 = "";
	global.map_messages_text_19 = "";
	global.map_messages_text_20 = "";

}
